--3. Видалення даних(DELETE)

--a) Видалимо зайві "нові страви", адміністратори випадково ввели в один і той самий час дані позиції

-- 1 шлях видалимо всі нові щойно додані страви
--DELETE FROM Menu
--WHERE item_name IN ('Пончікі від Порєва В.М.', 'Паляніца з сосичкою', 'Хліб укрАїнський');

--2 шлях: видалимо точно ті, які нам не потрібні 
--DELETE FROM Menu
--WHERE menu_id IN ('21', '22', '23'); 

--б) Видалимо випадково записаного клієнта двічі, хтось постарався
--DELETE FROM Clients
--WHERE client_id IN ('7'); 

--в)Видалити позицію з меню, яка більше не продається
--DELETE FROM Menu 
--WHERE item_name = 'Сендвіч з куркою';

--г)Видалити клієнта, який не має бонусів та історії замовлень (за телефоном)
--DELETE FROM Clients
--WHERE phone = '+380683457889' AND bonus_points = 0;

--д)Видалити постачальника, з яким розірвано контракт
--DELETE FROM Suppliers 
--WHERE company_name = 'Цукровий завод'; 

